import spacy
# from spacy import displacy 
from spacy.matcher import Matcher
import pandas as pd
import unicodedata
from unidecode import unidecode
# from Levenshtein import *
from collections import defaultdict
import textdescriptives as td  #TEXTDESCRIPTIVES FR PSACY3
import numpy as np
import pandas as pd
import multiprocessing
from multiprocessing import Pool
import os
from joblib import Parallel, delayed

import time
start_time = time.time()

# rows_to_show = 10
#Load lib el
# nlp = spacy.load("el_core_news_sm")
# nlp = spacy.load("el_core_news_md")
nlp = spacy.load("el_core_news_lg")
matcher = Matcher(nlp.vocab)

def remove_greek_tones(input_string):
	return ''.join(
		char for char in unicodedata.normalize('NFD', input_string)
		if unicodedata.category(char) != 'Mn'
	)

def custom_filter(token):
	custom_stopwords = ['ακομα','ακομη','αλλα','αλλες','αλλη','αλλης','αλλων','αν','ανα','αναμεσα','απ','απο','αρα','αραγε','αργα','αρκετα','ας','αυριο','αυτα','αυτες','αυτη','αυτην','αυτης','αυτο','αυτοι','αυτον','αυτος','αυτου','αυτους','αυτων','αφου','γι','για','γιατι','δα','δε','δει','δεινα','δεν','δηλαδη','δι','δια','διοτι','δις','διχως','εαν','ειδεμη','ειθε','ειπαν','ειπε','εις','ειτε','εκαστα','εκαστες','εκαστη','εκαστην','εκαστης','εκαστο','εκαστοι','εκαστον','εκαστος','εκαστου','εκαστους','εκαστων','εκει','εκεινα','εκεινες','εκεινη','εκεινην','εκεινης','εκεινο','εκεινοι','εκεινον','εκεινος','εκεινου','εκεινους','εκεινων','εκτος','εμας','εμεις','εμενα','εμπρος','εν','ενα','εναν','ενας','ενος','εντελως','εντος','εντωμεταξυ','ενω','ενωπιον','εξ','εξαφνα','εξης','εξισου','εξω','επανω','επειδη','επειτα','επι','επιπλεον','επισης','επομενως','εσας','εσεις','εσενα','εστω','εσυ','ετερα','ετεραι','ετερας','ετερες','ετερη','ετερης','ετερο','ετεροι','ετερον','ετερος','ετερου','ετερους','ετερων','ετουτα','ετουτες','ετουτη','ετουτην','ετουτης','ετουτο','ετουτοι','ετουτον','ετουτος','ετουτου','ετουτους','ετουτων','ετσι','ευθυς','εφεξης','εχθες','εχτες','εχω','εως','η','ηδη','ητοι','ηττον','θα','ιδια','ιδιαν','ιδιας','ιδιες','ιδιο','ιδιοι','ιδιον','ιδιος','ιδιου','ιδιους','ιδιων','ιδιως','ισαμε','ισια','ισως','καθε','καθεμια','καθεμιας','καθενα','καθενας','καθενος','καθετι','καθολου','καθως','και','καμια','καμιαν','καμιας','καν','κανεν','κανενα','κανεναν','κανενας','κανενος','κανετε','κανουμε','κανουν','καποια','καποιαν','καποιας','καποιες','καποιο','καποιοι','καποιον','καποιος','καποιου','καποιους','καποιων','καποτε','καπου','καπως','κατ','κατι','κατιτι','κατοπιν','κατω','κι','κιολας','κλπ','κοντα','κτλ','κυριως','λογω','λοιπα','λοιπον','μα','μας','μαζι','μακαρι','μαλιστα','μαλλον','μας','με','μεθαυριο','μεμιας','μεν','μερικα','μερικες','μερικοι','μερικους','μερικων','μεσα','μεσω','μετ','μετα','μεταξυ','μεχρι','μη','μηδε','μην','μηπως','μητε','μια','μιαν','μιας','μολις','μολονοτι','μονομιας','μου','να','ναι','ο','οι','ολα','ολες','ολη','ολην','ολης','ολο','ολοι','ολον','ολονεν','ολος','ολου','ολους','ολων','ολως','ολωσδιολου','ομως','οποια','οποιαδηποτε','οποιαν','οποιανδηποτε','οποιας','οποιασδηποτε','οποιδηποτε','οποιες','οποιεσδηποτε','οποιο','οποιοδηποτε','οποιοι','οποιον','οποιονδηποτε','οποιος','οποιοσδηποτε','οποιου','οποιουδηποτε','οποιους','οποιουσδηποτε','οποιων','οποιωνδηποτε','οποτε','οποτεδηποτε','οπου','οπουδηποτε','οπως','ορισμενα','ορισμενες','ορισμενων','ορισμενως','οσα','οσαδηποτε','οσες','οσεσδηποτε','οση','οσηδηποτε','οσην','οσηνδηποτε','οσης','οσησδηποτε','οσο','οσοδηποτε','οσοι','οσοιδηποτε','οσον','οσονδηποτε','οσος','οσοσδηποτε','οσου','οσουδηποτε','οσους','οσουσδηποτε','οσων','οσωνδηποτε','οταν','οτι','οτιδηποτε','οτου','ου','ουδε','ουτε','παντα','παντοτε','παντου','παντως','παρ','παρα','πει','περα','περι','περιπου','περσι','περυσι','πια','πιθανον','πιο','πισω','πλαι','πλεον','πλην','ποια','ποιαν','ποιας','ποιες','ποιο','ποιοι','ποιον','ποιος','ποιου','ποιους','ποιων','πολλα','πολυ','ποσες','ποση','ποσην','ποσης','ποσο','ποσοι','ποσος','ποσους','ποτε','που','πουθε','πουθενα','πρεπει','πριν','προ','προκειται','προς','προτου','προχθες','προχτες','πρωτα','πρωτη','πρωτης','πρωτυτερα','πως','σαν','σας','σε','σεις','σημερα','σιγα','σου','στα','στη','στην','στης','στις','στο','στον','στου','στους','στων','συν','συχνα','συχνας','συχνες','συχνη','συχνην','συχνης','συχνο','συχνοι','συχνον','συχνος','συχνου','συχνου','συχνους','συχνων','συχνως','σχεδον','σωστα','τα','ταδε','ταυτα','ταυτες','ταυτη','ταυτην','ταυτης','ταυτο','ταυτον','ταυτος','ταυτου','ταυτοχρονα','ταυτων','τελικα','τελικως','τες','τετοια','τετοιαν','τετοιας','τετοιες','τετοιο','τετοιοι','τετοιον','τετοιος','τετοιου','τετοιους','τετοιων','τη','την','της','τι','τιποτα','τιποτε','τις','το','τοι','τον','τος','τοσα','τοσες','τοση','τοσην','τοσης','τοσο','τοσοι','τοσον','τοσος','τοσου','τοσους','τοσων','τοτε','του','τουλαχιστο','τουλαχιστον','τους','τουτα','τουτες','τουτη','τουτην','τουτης','τουτο','τουτοι','τουτοις','τουτον','τουτος','τουτου','τουτους','τουτων','τυχον','των','τωρα','υπ','υπερ','υπο','υποψη','υποψιν','υστερα','χθες','χτες','χωρις','ψηλα','ω','ως','ωσαν','ωσοτου','ωσπου','ωστε','ωστοσο','ωχ']
	remove_words = ['νυχτερινό','νυχτερινό','νυχτερινό','νυχτερινό','παρακάτω','τουρκικά','εργαζόμενοι','παράσχει','στοίχισε','μέρες','είδε','σκούρο','ανθρωποκυνητό','κεφαλαίου','ανάκτορα','μέτρων','δίνει','πούμε','έκλεισε','κομμάτων','δεκάδες','χαράτσι','Ασφάλισης','υπολογιστεί','υπολογιστούν','πλήρωνε','παραμείνει','αντιπρόεδρος','έδωσε','Πατρινός','αντιπάλων','εξωτερικό','πελάγη','νομού','Στερεάς','περίπτωση','οργανωτές','σωματεία','παράταξή','Παράταξης','πάνε','μεταβούν','απαντηθούν','παραστεί','καταληκτική','ερωτηθεί','χαρτών','σπουδαστές','επιτάχθηκε','κατάλοιπο','στάτους','προσωπικά','μεγάρου','κανείς','παλαιά','καράβια','πλάνα','πλάνα','αφορά','κρίνει','επισκεφτεί','ακούσει','φυλακών','Περιστύλιο','στον','εστίαση','πλήξει','κοινοποιήσεις','ανάδειξη','φόρες','τροχαίου','έμφραγμα','παράσημα','φορέσω','βάλω','παράτυπη','προς','είδες','παραχθεί','πρωτεύουσα','αυτή','σύμφωνα','εργαστούμε','Μέση','κανέναν','αυτό','εκατ.','επικεφαλής','κλιμακίων','πάνω','παραίνεση','μισή','κινητήρια','πάντα','Αναστασίου','παραστάσεις','Σύμφωνα','διάσπαρτες','όλων','Διάσελλα','ποταμό','ποταμού','παραδόθηκε','συντάξεων','μέσω','προσφύγων','ανακατανομή','κατάφερε','επιδείξει','λόγων','πουν','ψηφίσει','ψηφίσει','ψηφίσει','κατάλαβε','κάτι','πάλι','παραπάνω','πρωτόδικη','παραπέμπει','προέβη','κυκλώματα','παραπέμπουν','περιπτώσεις','καμία','ασκό','δώσει','άλλους','πιάτσα','αυτά','συμβολαίου','παγίου','παγίου','καταστήματα','εστίασε','επικεφαλής','κατοικίδια','κατοικίδιων','εκδίκαση','ούτε','αφορμή','γκέτο','Αντιπρόεδρος','αυτονόητα','ακούσω','μακάρι','προσωπείο','ανέχεστε','φέρετε','περιέλθει','σούπερ','κούρεμα','βόμβες','καλά','καλά','κάθεσαι','γκολ','Περόν','μπλοκάκια','σκληρόδετη','ποτέ','παράκανες','καταστήσουν','φορέσει','Συνεπώς','οικισμό','επίδοξων','κατάσβεσή','επικράτεια','Πικράκη','παράδεισο','απόκρισης','επιδόσεις','στου','Σέιχ','παρασκήνιο','ζήτημα','παράγει','πλακέτα','νομο','στίβο','κατάλαβα','παράγει','ψηφίζει','Μαργαρίτης','δουλικά','σταυρόλεξα','δουλικά','δουλικά','δουλικά','αφορμές','απλόχερα','τέλει','κομματικών','Πανούσης','τριάντα','είδα','ζήτησα','κράτησε','Καταρχάς','προβληθεί','Παρόλα','μπλογκ','δεσπόζει','επίγειος','παράδεισος','μπλογκ','κατευθύνει','πλάτη','επιτρόπου','παλαιό','περίπτωσή','κουρέψει','κανένα','βάλε','Πάνω','Είδα','παρόντες','παρόντες','μένουν','αντιπρόεδρο','κράτη','καντήλι','καταπιούν','ποταμός','γκάμα','ποστ','τετράπτυχο','site','Κρανίδι','αποστρατεία','κουμπάρα','κατήφορο','επιμέρους','παλαιάς','συνθήματα','παρότι','άλλοτε','σταθεί','μεσαίωνα','πηγε','δυνάμεων','τετράποδων','γέννα','πατάτας','πετάξω','προσφυγικές','κοίλης','στοπ','αναμένοντας','κατάπτυστες','Παρασκευάς','πλαστικό','χωρίσαμε','βρίσκουμε','αγοράκι','φορούσε','γενεές','μέτρου','χαρεί','σοκάκια','πανάκριβη','μάγια','έκτοτε','συνοδό','νυχτερινή','γκουρμέ','καύσωνα','φοράνε','ανοιχτόχρωμα','κοινοτήτων','τελείται','μασάς','περιφρούρησης','εισόδους','περιφρούρησης','αναπάντητα','υποκατάστημα','έκλεισαν','στηθεί','σοροί','επιβατών','προβλήματος','καραμπίνα','συμβολαίων','επισκεπτών','κουταβιών','ντου','διαδικτύου','διαδικτύου','κατηγορούσαν','υπέρογκη','υπέρογκα','κάμπινγκ','αναπάντητη','αποσταλεί','παραπόνου','αντίδικοι','παράξει','προκατόχους','συγκρίνει','σκανδάλων','κομματικό','πετάμε','κατάσβεση','θηλυ','επιχειρήσουν','κρίθηκε','κρούσματα','Παρασκευής','κατακαίει','αντιπάλους','πλήρωσε','λογισμικό','στενάχωρη','ασφάλισης','μέρας','Φυσικής','δεκάδων','διαμέτρου','τακτά','κομματικούς','κομματική','άνοιξη','σχολικής','βραδιά','γκέλα','ουραγό','ξαναπαίξει','συμφωνική','φορούσαν','Σωματείο','μπλακ','Προς','τουρνικέ','παρατάξεις','τραπεζιών','καταστήσει','κατάφεραν','κανένας','συνεργεία','συνεργείου','ακούσεις','ακούσεις','πατάνε','προτέρων','παραλίγο','τρίποντα','καρτών','μαστίχα','συμπεριέλαβε','μισό','μαστίχας','διατρέχει','συμπεριέλαβε','επίγειες','εντύπων','τετράμηνο','εγκαίρως','μικρόσωμα','μάγδα','μάγδα','συμμετείχε','καταλανικού','καταλανική','μωρέ','κονσερβοκουτι','μοίρασαν','αριστερας','σημερα','πρότερη','αυτοκριτική','διάφανα','Επικεφαλής','καραβάκι','βαρύτατο','κρέμασε','κρέμασε','μυθιστορήματος','αντιστοιχεί','Ποτέ','στεφάνου','επισκεφθεί','βασίσει','επισκεφθεί','Προσφύγων','Κάρολε','κρίνονται','πατάτες','πατάτες','μνήμα','μνήματα','τετράποδου','στεφάνων','ομότιτλο','φαντάρων','νυχτερινού','αδιάβλητο','καμπάνα','αδιάβλητο','Ανδρικάκη','περιβόητη','περιβόητη','περιβόητη','τετράποδοι','τόλμησαν','τόλμησαν','παλαιοί','κρατήσαμε','καταπάνω','συγκληθεί','διαδραση','διάβαζε','διάβαζα','διάβαζαν','Φυσική','Φυσικό','άνοδο','άνοδο','Εξάλλου','Κάμπου','φιλμ','φιλμ','φιλμ','φιλμ','καλούσες','κλόου','μπακ','δημοσιοποίησε','πέταξε','παντειο','καταβάσεις','κάθεται','Μέρες','παντελης','παράταξή','προβλήματος','επισκεφθεί','ζήτημα','ίδρυσε','έπαθαν','επιδόθηκε','αντιπάλου','προσεχή','κρίνουν','προβλήματά','επιλέξει','μέριμνα','καλούμε','εκατ','πρωτεύουσας','κομματικά','φαρμάκων','φαρμάκου','απέλυσε','προστατευόμενων','μαρτύρων','περιστύλιο','διάβασε','προστατευμένοι','χρονιάς','πετάνε','πολίτικη','ανατροφοδοτεί','καλούνται','πρωτογενή','ακριβών','διαφανεί','μαντάρα','Μπούλες','μοίρασε','αποκριάς','πολιτιστικούς','καλούμπα','Σφίγγει','αποκαλούμε','μαντάτα','σκόρερ','στεριάς','δίκτο','σοκάκι','καταστεί','διαβρώσει','σπείρεις','τελεί','κατάληψη','καθαρισμό','μαρίνα','παρών','κλιμάκια','προσφυγιάς','πλήρωσαν','εξάρθρωσε','εξάρθρωσε','παρατάσεις','πόρταλ','τόνισε','παραπανω','ακριβή','έκλεισα','κατάρτιση','λάβαμε','παραδοτέα','Επικρατείας','προβούν','πείσει','παραδόσεις','σπάσουν','χωριών','αντιπαροχή','Φυσικών','πολυτέκνων','αποδομήσω','προβλήθηκε','αποδομεί','Καθημερινής','Εσωτερικών','βαρειά','παραφράσει','ανακρίβεια','κρατήσει','παράταξης','μπαράζ','επικρίνει','πρόσφεραν','συνέλεξαν','μπουτόν','σκούρα','ανοιχτόχρωμο','εγκληματολόγος','εγκληματολόγο','περιστασιακή','παραλόγου','προγραμματισμένων','προβούμε','συνεργείο','λάβαρα','περσινό','συλληψή','σκιών','Παράταξη','χρίσμα','Συμμετείχαν','συμβάντων','ανεύρεση','σορός','μπάζα','ανακρίβειες','φαρμακερή','φαρμακερή','ασφάλιση','κατάπτυστος','κατάπτυστος','τετράποδος','μπαλάκια','πατριαρχείου','Πεντάγωνο','μήνυσης','προβλήµατα','προκαταβολική','κάρτ','νεύρα','φράγκο','ομολογιακό','ομολογιακού','μετρά','νομό','χρίσµα','Μαντάς','πλάτες','ρόδο','αποτέλεσαν','αποτέλεσαν','μήνυση','γυναικούλα','περσινή','νυχτερινής','δίνω','line','line','αντίποδα','Κομματικής','περιβόητου','περίδο','ακούσετε','ανήμερα','στημένη','στημένη','κομματικής','τόνιζε','μποι','Κόλλια','Παρασκάκης','σκάει','έκτροπα','επαναλάβει','Μπανάλ','αντιδημάρχου','κόλπους','κοντράρει','πρόσημο','κρατήσουν','καταληψιών','Πετσίτη','Πετσίτη','Ούτε','λιβάνι','Ποτάμηδες','ανάποδο','διορίες','φοράει','καταρράκωνε','τοσο','τοσο','κομματικοί','Περιστέρα','βαρελότα','προτού','δουλεια','κουτάκια','κουτάκια','προσέξτε','σκαλπ','σκαλπ','ζευγάς','σωματείο','μίλα','μούφα','εξοργισμένους','παράταξη','μπας','αρμάτων','αρμάτων','αρμάτων','παραδόθηκαν','Παράδεισο','Παράδεισο','απόλυτη','Δημοκράτες-66','ελιτ','καταρρεύσει','κομματίδια','κομματίδια','παρέλαβε','καμπανάκια','καμπάνες','μπούκαρε','αγωνιστής','τρέχα','προφυλαχθούν','υπουργάκου','κομματικού','στρατάρχη','στρατάρχη','μπουκάρουν','μπουκάρουν','περσινά','χωρίου','χωρίον','κατάφερες','κουμπάρες','γεράκος','πουλάει','πατάτα','χαλάσει','μπαλάκι','μπαλάκι','τουμπεκί','φαντασμάτων','Συμμετείχε','επικριτές','ψηφίζω','περίπολος','περίπολο','χωρίας','φυλακές','πολεμήσει','τερματίσει','χάρηκα','νόμιζες','γραμμένος','συνετέθη','χωρίστηκαν','επανακτήσει','ονομαστής','προφυλάκισης','καταλάβει','χαλίφη','αναστάσιμο','Ελευθέριος','προγραμματισμένες','προγραμματισμένη','τετράμηνη','προγραμματισμένο','αναπνευστικά','εξυπηρετούμενα','ανταλλάγματα','διευθύνοντος','συντηρημένες','σχηματισμένο','πλαγιές','υποδοχή','επισκεφθώ','προγραμματιστεί','χαρακτηριστεί','μπουλινγκ','κατάλαβες','μπόρα','επιχειρησιακή','οικονομολόγος','περίοπτη','σύμπλευση','δικαιώματα','συσχετισθεί','αστρονομικό','τροχός','πνευμόνια','κρεμάλες','κεφαλικό','καταλήψεις','κοινοτικές','μισά','συνεδριακό','πρωτοφανές','Ενοχος','αδιαφανές','φαντάζει','χρηματισμού','para','φαντάσματα','φίλες','πλευρό','επιμεληθεί','πρόσθεσε','επιτραπεί','οικισμούς','έπρεπε','μπάρα','πλαστικά','συσκευασίες','συσκευασία','συσκευασιών','σχεδίου','τραπεζικό','μέγεθός','σφουγγαράκια','επιχείρησαν','παράλια','συνεχίζει','επιχειρούσαν','προσθέτει','very','παρεκκλίσεις','πατάτε','διαρκές','κεράσουν','υποδοχής','συσχετισμός','υπόθεση.της','τροπή','εφόδου'] 

	# remove_words_no_tones = [remove_greek_tones(word) for word in remove_words]
	# print(remove_words_no_tones[1:10])
	# custom_stopwords = custom_stopwords + remove_words_no_tones
	#check if stop words exists in the token.text with not tones 
	# remove_words_unique = list(set(custom_stopwords))
	# token_no_tone = (''.join([c for c in unicodedata.normalize('NFD', token.text) if not unicodedata.combining(c)]))

	# if token_no_tone in remove_words_unique:
	# 		return not(True)
	return not (
				token.is_punct
			or str(token.dep_) == "advmod"
			or str(token.dep_) == "case"
			or str(token.dep_) == "cc"
			or str(token.dep_) == "dobj"
			or str(token.dep_) == "dep"
			or str(token.dep_) == "det"
			or str(token.dep_) == "mark"
			or str(token.dep_) == "pobj"
			or str(token.dep_) == "pron"
			# or str(token.dep_) == "punct"
			or str(token.dep_) == "sconj"
			or str(token.tag_) == "ADP"
			or str(token.tag_) == "ADV"
			or str(token.tag_) == "CCONJ"
			or str(token.tag_) == "DET"
			or str(token.tag_) == "PRON"
			or str(token.tag_) == "PART"
			or str(token.tag_) == "PUNCT"
			or str(token.tag_) == "PROPN"
			or str(token.tag_) == "SCONJ"
			or str(token.tag_) == "SPACE"
			or token.is_digit
			or token.is_stop
	)

def define_cleantext(text):
	# return(text,text)
	doc_content = nlp(text)
	filtered_tokens_with_duplicates_content = [
			(token.text,token.lemma_) for token in doc_content if custom_filter(token)
	]
	# print(filtered_tokens_with_duplicates_content)
	original_tokens = [token[0] for token in filtered_tokens_with_duplicates_content]
	lemmatized_tokens = [token[1] for token in filtered_tokens_with_duplicates_content]
	tokens_content = ' '.join(original_tokens)
	lemmatized_tokens_content = ' '.join(lemmatized_tokens)
	# print(tokens_content)
	# print(lemmatized_tokens_content)
	return(tokens_content,lemmatized_tokens_content)

# Parse through spacy
def clean_text_parallel(text):
    clean_words = Parallel(n_jobs=4)(
        delayed(define_cleantext)(text) for text in text.split()
    )
    words = ''.join(clean_words)
    return words

def process_batch(args):
	df, batch_size = args
	processed_batches = []

	# Your data processing/cleaning logic goes here
	for i in range(0, len(df), batch_size):
		batch = df.iloc[i:i + batch_size]
		print(df.iloc[i:i + batch_size])
		# df[['cleanedtext','cleaned_text_lemmas']] =  df.head(10)['article_text'].apply(lambda x: pd.Series(define_cleantext(x)))
		batch[['cleanedtext','cleaned_text_lemmas']] =  batch['article_text'].apply(lambda x: pd.Series(define_cleantext(x))) #this is wokring
		# batch[['cleanedtext','cleaned_text_lemmas']] =  batch['article_text'].apply(lambda x: pd.Series(clean_text_parallel(x))) #this is wokring
		processed_batches.append(batch)
	return processed_batches

def main():
	# Replace with your actual input file names and parameters
	# df = pd.read_csv("high_sites_2017-2018_top_98.csv")
	# print(df)
	# df[['cleanedtext','cleaned_text_lemmas']] =  df.head(10)['article_text'].apply(lambda x: pd.Series(clean_text_parallel(x)))
 	
	
	# exit()
	files_to_process = [
			# ('high_sites_2017-2018_top_98.csv',4000), 4153 lines so bach worked with 2 files
   	  # ('high_sites_2016.csv',4000), has 116832 lines //batch  17*4000 = 68000
	    # ('high_sites_2016_top_75.csv',4000), 5882 lines // batch of 2 files 
	    # ('high_sites_2017-2018.csv',10000),
			# ('high_sites_2017-2018_00',10000),
			# ('high_sites_2017-2018_01',10000),
			# ('high_sites_2017-2018_00',10000),
			# ('high_sites_2017-2018_01',10000),
			# ('high_sites_2017-2018_02',10000),
			# ('high_sites_2022-2023_00',10000),
			('cnn_ellada_fb.csv',5000),
			('cnn_politiki_fb.csv',5000),
			('dikaiologitika_ellada_fb.csv',5000),
			('dikaiologitika_politiki_fb.csv',5000),
			('efsyn_ellada_fb.csv',5000),
			('efsyn_politiki1_fb.csv',5000),
			('efsyn_politiki_fb.csv',5000),
			('features_ks_runnable.py',5000),
			('kathimerini_ellada_fb.csv',5000),
			('kathimerini_politiki_fb.csv',5000),
			('protothema_ellada_fb.csv',5000),
			('protothema_politiki_fb.csv',5000)
	]

		# Use multiprocessing Pool to parallelize processing
	with Pool(processes=12) as pool:
		print(pool)
		for file, batch_size in files_to_process:
			# Read the CSV file into a DataFrame
			df = pd.read_csv(file)
			print(df)
			# Process the DataFrame in batches
			processed_batches = pool.map(process_batch, [(df, batch_size)])[0]
			# print(process_batch)
			# Save processed batches to CSV files
			for i, batch in enumerate(processed_batches):
				output_file = f"processed_{os.path.basename(file)}_Multiprocess_batch_{i}.csv"
				batch.to_csv(output_file, index=False)
				print('first batch finished')

if __name__ == "__main__":
  # Record the end time
	end_time = time.time()
	print(multiprocessing.cpu_count())
	main()
 # Calculate the elapsed time
	elapsed_time = end_time - start_time
	# Print the start and end times
	# print('10 articles are ready in ')
	print(f"Start Time: {start_time}")
	print(f"End Time: {end_time}")
	print(f"Elapsed Time: {elapsed_time} seconds")

